#pragma once

/*----------Конфигурация-------------------------------------------------------*/

#define USE_TIME_FOR_RANDOM		/*закомментировать для получения одинаковых рандомных значений при каждом запуске программы*/
#define LOWER_RAND_VALUE -20
#define UPPER_RAND_VALUE 30
#define PRINT_ARRAYS			/*закомментировать, чтобы отключить вывод массивов (рекомендуется закомментировать, если размер массивов очень большой)*/

/*------------------------------------------------------------------------------*/